# # #words = "Hello, \"test\" 'words'!!"
# # words = "Hello, \t \t 333 \n test\" 'words'!!"
# # print(words)
#
# # verse = 'И труд нелеп, и бестолкова праздность,\n\
# # И с плеч долой всё та же голова,\n\
# # Когда приходит бешеная ясность,\n\
# # Насилуя притихшие слова.'
# verse = ('И труд нелеп, и бестолкова праздность,\n'
#         'И с плеч долой всё та же голова,\n'
#         'Когда приходит бешеная ясность,\n'
#         'Насилуя притихшие слова.\n')
#
# print(verse)

verse = '''\
И труд нелеп, и бестолкова праздность,
И с плеч долой всё та же голова,
Когда приходит бешеная ясность,
Насилуя притихшие слова.\
'''
print(verse)