# ---------Методы словарей----------

product1 = {
    'title': 'Sony', 'price': 100,
    'title2': 'iPhone', 'price2': 300,
    'title3': 'Samsung', 'price3': 200,
}
# ------------------------------------------------------------------------------------------------
# print(product1.items())            # - возвращает пары (ключ, значение).

# ------------------------------------------------------------------------------------------------
# print(product1.keys())             # - возвращает ключи в словаре.

# ------------------------------------------------------------------------------------------------
# print(product1.pop('title', 'no')) # - удаляет ключ и возвращает значение. Если ключа нет, возвращает default (по умолчанию бросает исключение).

# ------------------------------------------------------------------------------------------------
# dict.popitem()                      # - удаляет и возвращает пару (ключ, значение). Если словарь пуст, бросает исключение KeyError. Помните, что словари неупорядочены.
# pro = product1.popitem()
# print(pro, product1, sep='\n')
# print(product1.popitem())
# print(pro)
# print(product1)
# ------------------------------------------------------------------------------------------------
# print(product1.setdefault('title6'))
# print(product1)

# ------------------------------------------------------------------------------------------------

print(product1)

product1.update({'price': 800})
product1.update({'test': 'value'})

print(product1)



print(product1.values())